{
  "metadata": {
    "total_size": 4.357860565185547,
    "param_groups": "pytorch_optim_group.bin"
  },
  "weight_map": {
    "316": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "317": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "318": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "319": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "320": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "321": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "335": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "336": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "337": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "338": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "339": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "340": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "354": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "355": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "356": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "357": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "358": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "359": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "373": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "374": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "375": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "376": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "377": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "378": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "392": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "393": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "394": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "395": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "396": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "397": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "411": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "412": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "413": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "414": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "415": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "416": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "430": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "431": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "432": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "433": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "434": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "435": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "449": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "450": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "451": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "452": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "453": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "454": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "468": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "469": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "470": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "471": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "472": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "473": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "487": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "488": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "489": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "490": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "491": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "492": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "506": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "507": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "508": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "509": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "510": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "511": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "525": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "526": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "527": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "528": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "529": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "530": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "544": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "545": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "546": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "547": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "548": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "549": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "563": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "564": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "565": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "566": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "567": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "568": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "582": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "583": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "584": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "585": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "586": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "587": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "601": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "602": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "603": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "604": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "605": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "606": "pytorch_optim-stage-00002-00002-shard-00001.bin",
    "0": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "1": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "2": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "3": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "4": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "5": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "18": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "19": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "20": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "21": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "22": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "23": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "24": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "37": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "38": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "39": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "40": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "41": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "42": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "43": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "56": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "57": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "58": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "59": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "60": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "61": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "62": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "75": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "76": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "77": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "78": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "79": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "80": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "81": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "94": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "95": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "96": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "97": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "98": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "99": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "100": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "113": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "114": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "115": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "116": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "117": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "118": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "119": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "132": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "133": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "134": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "135": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "136": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "137": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "138": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "151": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "152": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "153": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "154": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "155": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "156": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "157": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "170": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "171": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "172": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "173": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "174": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "175": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "176": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "189": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "190": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "191": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "192": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "193": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "194": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "195": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "208": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "209": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "210": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "211": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "212": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "213": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "214": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "227": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "228": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "229": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "230": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "231": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "232": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "233": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "246": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "247": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "248": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "249": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "250": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "251": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "252": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "265": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "266": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "267": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "268": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "269": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "270": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "271": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "284": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "285": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "286": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "287": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "288": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "289": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "290": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "303": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "304": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "6": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "7": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "8": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "9": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "10": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "11": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "25": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "26": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "27": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "28": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "29": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "30": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "44": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "45": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "46": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "47": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "48": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "49": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "63": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "64": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "65": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "66": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "67": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "68": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "82": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "83": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "84": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "85": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "86": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "87": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "101": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "102": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "103": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "104": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "105": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "106": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "120": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "121": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "122": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "123": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "124": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "125": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "139": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "140": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "141": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "142": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "143": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "144": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "158": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "159": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "160": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "161": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "162": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "163": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "177": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "178": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "179": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "180": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "181": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "182": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "196": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "197": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "198": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "199": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "200": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "201": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "215": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "216": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "217": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "218": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "219": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "220": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "234": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "235": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "236": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "237": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "238": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "239": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "253": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "254": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "255": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "256": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "257": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "258": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "272": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "273": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "274": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "275": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "276": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "277": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "291": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "292": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "293": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "294": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "295": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "296": "pytorch_optim-stage-00001-00001-shard-00001.bin",
    "305": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "306": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "307": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "308": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "309": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "322": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "323": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "324": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "325": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "326": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "327": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "328": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "341": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "342": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "343": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "344": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "345": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "346": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "347": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "360": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "361": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "362": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "363": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "364": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "365": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "366": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "379": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "380": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "381": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "382": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "383": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "384": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "385": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "398": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "399": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "400": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "401": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "402": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "403": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "404": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "417": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "418": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "419": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "420": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "421": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "422": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "423": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "436": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "437": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "438": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "439": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "440": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "441": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "442": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "455": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "456": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "457": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "458": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "459": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "460": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "461": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "474": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "475": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "476": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "477": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "478": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "479": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "480": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "493": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "494": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "495": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "496": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "497": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "498": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "499": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "512": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "513": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "514": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "515": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "516": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "517": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "518": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "531": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "532": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "533": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "534": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "535": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "536": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "537": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "550": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "551": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "552": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "553": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "554": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "555": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "556": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "569": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "570": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "571": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "572": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "573": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "574": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "575": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "588": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "589": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "590": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "591": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "592": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "593": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "594": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "607": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "608": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "609": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "610": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "310": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "311": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "312": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "313": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "314": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "315": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "329": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "330": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "331": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "332": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "333": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "334": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "348": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "349": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "350": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "351": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "352": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "353": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "367": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "368": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "369": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "370": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "371": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "372": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "386": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "387": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "388": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "389": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "390": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "391": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "405": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "406": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "407": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "408": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "409": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "410": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "424": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "425": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "426": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "427": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "428": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "429": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "443": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "444": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "445": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "446": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "447": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "448": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "462": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "463": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "464": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "465": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "466": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "467": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "481": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "482": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "483": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "484": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "485": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "486": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "500": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "501": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "502": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "503": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "504": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "505": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "519": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "520": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "521": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "522": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "523": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "524": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "538": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "539": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "540": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "541": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "542": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "543": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "557": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "558": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "559": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "560": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "561": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "562": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "576": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "577": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "578": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "579": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "580": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "581": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "595": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "596": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "597": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "598": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "599": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "600": "pytorch_optim-stage-00002-00001-shard-00001.bin",
    "12": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "13": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "14": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "15": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "16": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "17": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "31": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "32": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "33": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "34": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "35": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "36": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "50": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "51": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "52": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "53": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "54": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "55": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "69": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "70": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "71": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "72": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "73": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "74": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "88": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "89": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "90": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "91": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "92": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "93": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "107": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "108": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "109": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "110": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "111": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "112": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "126": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "127": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "128": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "129": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "130": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "131": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "145": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "146": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "147": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "148": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "149": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "150": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "164": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "165": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "166": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "167": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "168": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "169": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "183": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "184": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "185": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "186": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "187": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "188": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "202": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "203": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "204": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "205": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "206": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "207": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "221": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "222": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "223": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "224": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "225": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "226": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "240": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "241": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "242": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "243": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "244": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "245": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "259": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "260": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "261": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "262": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "263": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "264": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "278": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "279": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "280": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "281": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "282": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "283": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "297": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "298": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "299": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "300": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "301": "pytorch_optim-stage-00001-00002-shard-00001.bin",
    "302": "pytorch_optim-stage-00001-00002-shard-00001.bin"
  }
}
